Revit 2027 API
ImageExportOptions.IsValidForSaveToProjectAsImage Method
 Verify if ImageExportOptions object is valid for calling saveToProjectAsImage
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidForSaveToProjectAsImage(
	ImageExportOptions options,
	Document doc
)
Public Shared Function IsValidForSaveToProjectAsImage (
	options As ImageExportOptions,
	doc As Document
) As Boolean
public:
static bool IsValidForSaveToProjectAsImage(
	ImageExportOptions^ options,
	Document^ doc
)
static member IsValidForSaveToProjectAsImage :
        options : ImageExportOptions *
        doc : Document -> bool
Parameters
options ImageExportOptions
 ImageExportOptions object to be validated
doc Document
 Document for view name verification
Return Value
Boolean
 True if ImageExportOptions object is valid for calling saveToProjectAsImage; false otherwise
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace